app/controllers/places_controller.rb

  def index
    if session[:user_id]
      user = User.find(session[:user_id])
      places = user.places
    else
      places = Place.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "places".* FROM "places"

  def create
    place = Place.create!(place_params)
---
INSERT INTO "places" ("name", "location", "image", "category", "user_id", "created_at", "updated_at", "website", "price_level") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    place = find_place
    place.destroy
---
DELETE FROM "places" WHERE "places"."id" = ?  [["id", 5]]

  def find_place
    Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]