app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: User.all, status: :ok

INSERT INTO "users" ("username", "email", "password_digest", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    user = User.create!(user_params)

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Yuyi Blah"], ["last_name", "Li Yum"], ["updated_at", "2022-01-25 20:50:31.458963"], ["id", 1]]
---
  def update
    user = find_user
    user.update!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    User.find(session[:user_id])